{
  "navigation": {
    "home": "Home",
    "about": "About",
    "Works": "Works",
    "Contact": "Contact",
    "blog": "Blog"
  },
  "header": {
    "hi": "Hi, I'm Lucas 👋",
    "dev": "Developer FullStack",
    "footer": "Passionate about web developer.",
    "button": {
      "cv": "Resume",
      "work": "Projects"
    }
  },
  "about": {
    "title": "About me.",
    "body": "\"I am a passionate full-stack web developer with experience in a wide range of technologies and frameworks, including <strong>React</strong>, <strong>Next.js</strong>, <strong>Redux</strong>, <strong>TypeScript</strong>, <strong>Node.js</strong>, <strong>NestJS</strong>, <strong>Express</strong>, <strong>GraphQL</strong>, <strong>MongoDB</strong>, <strong>PostgreSQL</strong>, <strong>Css</strong>, <strong>Figma</strong>, and more.<br/><br/>My meticulous attention to detail and passion for innovation combine to create robust and engaging solutions.<br/><br/>I am always eager to explore new technologies and bring my energy to every project. I am ready to take your ideas to the next level!\""
  },

  "techSkills": {
    "title": "Tech skills"
  },
  "dataQuest": [
    {
      "title": "Tools",
      "body": "With an insatiable curiosity, I delve into essential tools like Figma to transform ideas into immersive designs. Furthermore, I employ tools such as npm, ESLint, and Prettier to refine code quality, and leverage Bash and Git for a seamless workflow. I am always ready to bring your visions to life with a touch of technical excellence."
    },
    {
      "title": "Testing",
      "body": "Testing isn't just a phase in my development process; it's a cornerstone of ensuring quality and reliability.<br/>I understand that a solid testing strategy can make or break a project, which is why I embrace testing tools like Jest, React Testing Library, Puppeteer, Cypress, and Vitest.<br/>By meticulously crafting and executing tests, I ensure that each feature is rigorously validated before it reaches the user.<br/>I also leverage powerful tools like GitHub Actions and Docker for isolated environments, allowing me to confidently explore different scenarios without compromising stability.<br/>Testing isn't an afterthought for me – it's a commitment to delivering excellence and building products that stand the test of time."
    },
    {
      "title": "UI/UX",
      "body": "My focus goes beyond code, embracing the craft of crafting exceptional experiences. As a developer with a keen eye for design, I fuse technical skills with a passion for User Interface and User Experience (UI/UX) design. My tool of choice is Figma, where I transform concepts into captivating and functional designs. Every line of code I write is influenced by my drive to create intuitive and visually appealing products that deeply resonate with users. I take pride in not just building applications, but weaving visual narratives that excite and delight as users navigate through each screen and functionality. My dedication to UI/UX development translates into products that not only perform well but also captivate and delight, and I'm eager to bring this passion to your team and projects."
    }
  ],
  "works": {
    "title": "Projects",
    "add": "more projects",
    "principal": [
      {
        "title": "food recipe",
        "image": "screenshot-food.png",
        "description": "an PI by henry conde we put into practice the skills learned in soy henry's bootcamp",
        "github": "https://github.com/Lukis76/PI-Food-main",
        "web": "https://food-proyect-pi.netlify.app/",
        "chip": ["react", "redux", "style components", "sequelize", "postgresql", "nodejs", "express"],
        "app": {
          "msg": "In development",
          "development": false
        }
      },
      {
        "title": "NFtrade",
        "image": "screenshot-nftrade.jpg",
        "description": "Website, NFT e-commerce platform where you can both buy and sell them, create collections, notification system, dashboard, comments, and likes, just like many other typical functionalities of an e-commerce platform.",
        "github": "https://github.com/NicoCastagnet/PF-NFTRADE",
        "web": "https://pf-nftrade.netlify.app/",
        "chip": ["next.js", "prisma", "postgresql", "tailwindcss", "mercado pago"],
        "app": {
          "msg": "In development",
          "development": false
        }

      },
      {
        "title": "chat app",
        "image": "screen-shot-chat-app-optimized-webp.webp",
        "description": "app chat clone slack",
        "github": "https://github.com/NicoCastagnet/PF-NFTRADE",
        "web": "https://pf-nftrade.netlify.app/",
        "chip": ["developing"],
        "app": {
          "msg": "In development",
          "development": true
        }

      }
    ]
  },
  "contact": {
    "email": {
      "label": "Your email",
      "placeholder": "example@gmail.com"
    },
    "body": {
      "label": "Your message",
      "placeholder": "write your thoughts here..."
    },
    "submit": "Send"
  },
  "footer": {
    "copyright": "All rights reserved by lucas manoguerra developer full stack."
  }
}
